CREATE DATABASE  IF NOT EXISTS `mojoin` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `mojoin`;
-- MySQL dump 10.13  Distrib 8.0.41, for Win64 (x86_64)
--
-- Host: localhost    Database: mojoin
-- ------------------------------------------------------
-- Server version	8.0.41

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `tag`
--

DROP TABLE IF EXISTS `tag`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `tag` (
  `tIndex` int unsigned NOT NULL,
  `Tag` char(25) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `TagNOR` char(25) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  PRIMARY KEY (`tIndex`),
  UNIQUE KEY `tIndex_UNIQUE` (`tIndex`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tag`
--

LOCK TABLES `tag` WRITE;
/*!40000 ALTER TABLE `tag` DISABLE KEYS */;
INSERT INTO `tag` VALUES (1,'BE','BE\r'),(2,'BG','愛情\r'),(3,'BG愛情','愛情\r'),(4,'BL','BL\r'),(5,'C8取n的有趣互動','C8取n的有趣互動\r'),(6,'GL','GL\r'),(7,'HE','HE\r'),(8,'OL','OL\r'),(9,'Youtube','Youtube\r'),(10,'youtuber店員的日常記事','Youtube\r'),(11,'一方死亡','一方死亡\r'),(12,'人格分裂','人格分裂\r'),(13,'十年創作經歷','十年創作經歷\r'),(14,'女主','女主\r'),(15,'女強重生','女主\r'),(16,'小編哭3次','小編哭3次\r'),(17,'不按牌理出牌才是王道','不按牌理出牌才是王道\r'),(18,'中二','中二\r'),(19,'中樂透','中樂透\r'),(20,'公主婆爆','公主婆爆\r'),(21,'分手不快樂','分手不快樂\r'),(22,'反差萌','反差萌\r'),(23,'天使','天使\r'),(24,'天界護法轉世','天使\r'),(25,'天師少年','少年\r'),(26,'天然呆蘿莉','少女\r'),(27,'少女','少女\r'),(28,'少年少女','少年\r'),(29,'少年們的合宿生活(?)','少年\r'),(30,'幻想','幻想\r'),(31,'幻想冒險','幻想\r'),(32,'手足','手足\r'),(33,'日式古風','古風\r'),(34,'日常','日常\r'),(35,'火山爆發','末日\r'),(36,'世仇','世仇\r'),(37,'世界末日','末日\r'),(38,'世界名著','世界名著\r'),(39,'仙俠','仙俠\r'),(40,'兄控妹妹','兄控\r'),(41,'古代','古代\r'),(42,'古代言情','古代\r'),(43,'古典','古典\r'),(44,'古風','古風\r'),(45,'古風奇幻','奇幻\r'),(46,'只好一起睡了','愛情\r'),(47,'台北覆滅','末日\r'),(48,'台味BL','BL\r'),(49,'台灣冒險','冒險\r'),(50,'史詩','史詩\r'),(51,'囚禁','囚禁\r'),(52,'失戀','失戀\r'),(53,'巨乳幼馴染','青梅竹馬\r'),(54,'平行時空','平行時空\r'),(55,'幼馴染','青梅竹馬\r'),(56,'末日','末日\r'),(57,'末世','末日\r'),(58,'末世愛情','末日\r'),(59,'本格推理','推理\r'),(60,'正劇','正劇\r'),(61,'民族風','民族風\r'),(62,'犯罪','犯罪\r'),(63,'犯罪懸疑','犯罪\r'),(64,'玄幻','玄幻\r'),(65,'玄幻仙俠','玄幻\r'),(66,'生存','生存\r'),(67,'生存遊戲','生存\r'),(68,'石榴石妖精','石榴石妖精\r'),(69,'先吃後愛(?)','愛情\r'),(70,'先婚後愛','愛情\r'),(71,'吃播','吃播\r'),(72,'各色美男應有盡有','帥哥\r'),(73,'同居','同居\r'),(74,'同居日常','同居\r'),(75,'后宮','愛情\r'),(76,'因妹妹而死的我','因妹妹而死的我\r'),(77,'因果業障','靈異\r'),(78,'宅男','宅男\r'),(79,'宇宙','宇宙\r'),(80,'年下','年下\r'),(81,'年齡差','年齡差\r'),(82,'成長','成長\r'),(83,'有貓就是正義','有貓就是正義\r'),(84,'百合','GL\r'),(85,'西方古典','西方古典\r'),(86,'克蘇魯','妖怪\r'),(87,'吸血鬼','妖怪\r'),(88,'妖怪','妖怪\r'),(89,'妖精使','妖怪\r'),(90,'快穿','穿越\r'),(91,'我的純情上司怎麼那麼可愛','BL\r'),(92,'扭曲','扭曲\r'),(93,'每個人都是異常者','穿越\r'),(94,'每週四更新','每週四更新\r'),(95,'求而不得','求而不得\r'),(96,'系統','系統\r'),(97,'奇幻','奇幻\r'),(98,'奇幻冒險','奇幻\r'),(99,'奇幻校園','奇幻\r'),(100,'姊妹','手足\r'),(101,'怪物','妖怪\r'),(102,'怪談','靈異\r'),(103,'武俠','武俠\r'),(104,'治療','治療\r'),(105,'治癒','治療\r'),(106,'法庭攻防','法庭攻防\r'),(107,'玩家','玩家\r'),(108,'直播斗內','Youtube\r'),(109,'社恐房東','社恐房東\r'),(110,'長篇','長篇\r'),(111,'青春','青春\r'),(112,'青春校園','青春\r'),(113,'青春熱血','青春\r'),(114,'青梅竹馬','青梅竹馬\r'),(115,'便利商店','便利商店\r'),(116,'信件解謎','推理\r'),(117,'冒險','冒險\r'),(118,'前生今世','前生今世\r'),(119,'勇者','英雄\r'),(120,'契約','契約\r'),(121,'姨甥','姨甥\r'),(122,'架空','架空\r'),(123,'架空背景','架空\r'),(124,'科幻','科幻\r'),(125,'科幻未來','科幻\r'),(126,'科幻校園','科幻\r'),(127,'科幻愛情','科幻\r'),(128,'科技','科幻\r'),(129,'穿越','穿越\r'),(130,'穿越到乙女遊戲裡變成狗狗是不是搞錯了什麼?','穿越\r'),(131,'穿越架空','穿越\r'),(132,'穿越異世界','穿越\r'),(133,'美少女神明侵占我的床','穿越\r'),(134,'美食','美食\r'),(135,'英雄','英雄\r'),(136,'虐心','虐心\r'),(137,'軍事','軍事\r'),(138,'重生','重生\r'),(139,'音樂','音樂\r'),(140,'宮廷','宮廷\r'),(141,'宮廷風','宮廷\r'),(142,'恐怖','黑暗\r'),(143,'捐血','捐血\r'),(144,'校園','校園\r'),(145,'浪漫奇幻','奇幻\r'),(146,'浪漫輕喜劇','愛情\r'),(147,'特別企劃','特別企劃\r'),(148,'狼人','妖怪\r'),(149,'神怪','奇幻\r'),(150,'神話','奇幻\r'),(151,'耽美','BL\r'),(152,'迷茫','迷茫\r'),(153,'追尋自我','追尋自我\r'),(154,'逆綁架','逆綁架\r'),(155,'骨科','骨科\r'),(156,'鬼月','靈異\r'),(157,'偵探','推理\r'),(158,'偶像','偶像\r'),(159,'偽娘','偽娘\r'),(160,'偽娘攻','偽娘\r'),(161,'彗星撞地球','末日\r'),(162,'推理','推理\r'),(163,'救贖','救贖\r'),(164,'殺手','黑暗\r'),(165,'清水','清水\r'),(166,'爽文','爽文\r'),(167,'現代','現代\r'),(168,'現代輕奇幻','現代\r'),(169,'甜文','甜文\r'),(170,'甜寵','甜文\r'),(171,'異世界','異世界\r'),(172,'異界','穿越\r'),(173,'異能','奇幻\r'),(174,'異想','奇幻\r'),(175,'軟萌','軟萌\r'),(176,'這次你要PICK哪一個？','偶像\r'),(177,'都市','都市\r'),(178,'都市傳說','靈異\r'),(179,'都市療癒','都市\r'),(180,'都是月亮惹的禍','都是月亮惹的禍\r'),(181,'都會','都市\r'),(182,'都會愛情','都市\r'),(183,'陰陽','靈異\r'),(184,'陰陽兩隔也要永遠相伴','靈異\r'),(185,'陰謀','黑暗\r'),(186,'惡搞','搞怪\r'),(187,'惡魔','黑暗\r'),(188,'最美的愛情是遺憾','愛情\r'),(189,'森林','森林\r'),(190,'殘酷','殘酷\r'),(191,'無CP','無CP\r'),(192,'無法實現的暗戀','愛情\r'),(193,'無限流','無限流\r'),(194,'短篇','短篇\r'),(195,'硬奇幻','奇幻\r'),(196,'童年','童話\r'),(197,'童話','童話\r'),(198,'虛心','虛心\r'),(199,'虛擬','科幻\r'),(200,'超級英雄','英雄\r'),(201,'黑暗','黑暗\r'),(202,'黑幫','黑道流氓\r'),(203,'催眠','黑暗\r'),(204,'催淚','催淚\r'),(205,'傲嬌','傲嬌\r'),(206,'微BL','BL\r'),(207,'微腐','BL\r'),(208,'微懸疑','懸疑\r'),(209,'微靈異奇幻','靈異\r'),(210,'想愛卻不能愛','愛情\r'),(211,'想靠近卻害怕失去','愛情\r'),(212,'愛的各種樣貌','愛情\r'),(213,'愛能夠被複製嗎','愛情\r'),(214,'愛情','愛情\r'),(215,'愛情消失的證據','愛情\r'),(216,'感動','感動\r'),(217,'搞怪','搞怪\r'),(218,'搞笑','搞笑\r'),(219,'搭檔','搭檔\r'),(220,'新手上路','新手上路\r'),(221,'暖心短篇','短篇\r'),(222,'暗戀','愛情\r'),(223,'溫柔女鬼讓你不再孤單(?)','靈異\r'),(224,'溫柔病態功 X 失禁迷茫受','BL\r'),(225,'溫柔電波青年攻x軟綿抱枕少年受','BL\r'),(226,'溫馨','溫馨\r'),(227,'溫馨玻璃渣','溫馨\r'),(228,'禁斷戀','禁斷戀\r'),(229,'罪惡','黑暗\r'),(230,'腹黑','腹黑\r'),(231,'萬聖節','萬聖節\r'),(232,'解謎','推理\r'),(233,'跨域','跨域\r'),(234,'遊戲','遊戲\r'),(235,'電影改編','電影改編\r'),(236,'預言','預言\r'),(237,'實境','實境\r'),(238,'慠嬌','傲嬌\r'),(239,'演藝圈','演藝圈\r'),(240,'監禁','黑暗\r'),(241,'網紅','網紅\r'),(242,'網遊','遊戲\r'),(243,'腐','BL\r'),(244,'蒸氣龐克SteamPunk','奇幻\r'),(245,'輕小說','輕小說\r'),(246,'輕奇幻','奇幻\r'),(247,'輕推理','推理\r'),(248,'輕鬆','輕鬆\r'),(249,'輕鬆搞笑','搞笑\r'),(250,'輕懸疑','懸疑\r'),(251,'劇本殺','懸疑\r'),(252,'劇情翻轉','反轉\r'),(253,'寫實','寫實\r'),(254,'廢人社','廢材\r'),(255,'廢土文學','末日\r'),(256,'廢材男主','廢材\r'),(257,'廢材逆襲','廢材\r'),(258,'熟悉的小鹿最對味','熟悉的小鹿最對味\r'),(259,'熱血','熱血\r'),(260,'誰才是真正的怪物','誰才是真正的怪物\r'),(261,'養成','養成\r'),(262,'戰爭','戰鬥\r'),(263,'戰鬥','戰鬥\r'),(264,'機台比賽','競技\r'),(265,'歷史','歷史\r'),(266,'謀殺案','懸疑\r'),(267,'遲來的救贖','救贖\r'),(268,'遺忘是最好的解藥','遺忘是最好的解藥\r'),(269,'擬人','擬人\r'),(270,'殭屍','妖怪\r'),(271,'療癒','療癒\r'),(272,'療癒與被療癒','療癒\r'),(273,'職場','職場\r'),(274,'轉生','轉生\r'),(275,'轉折','反轉\r'),(276,'雙向奔赴','雙向奔赴\r'),(277,'雙向救贖','救贖\r'),(278,'雙重人格','人格分裂\r'),(279,'騎士','騎士\r'),(280,'獸耳','獸耳\r'),(281,'羅曼史','愛情\r'),(282,'羅莉','蘿莉\r'),(283,'願望','願望\r'),(284,'懸疑','懸疑\r'),(285,'懸疑反轉','懸疑\r'),(286,'懸疑推理','懸疑\r'),(287,'競技','競技\r'),(288,'警偵','推理\r'),(289,'議題','議題\r'),(290,'霸氣刺青8+9','黑道流氓8+9\r'),(291,'魔王','異世界\r'),(292,'魔王勇者','異世界\r'),(293,'魔法','魔法\r'),(294,'魔物','異世界\r'),(295,'歡喜冤家','歡樂\r'),(296,'歡樂','歡樂\r'),(297,'戀愛','愛情\r'),(298,'戀愛喜劇','愛情\r'),(299,'戀愛養成','愛情\r'),(300,'蘿莉','蘿莉\r'),(301,'驚悚','驚悚\r'),(302,'驚悚推理','驚悚\r'),(303,'靈異','靈異\r'),(304,'靈異搞笑','靈異\r'),(305,'靈異驚悚','靈異\r'),(306,'讚豆拿搞鬼盒','靈異\r'),(528,'少年少女','少女\r'),(531,'幻想冒險','冒險\r'),(542,'古代言情','愛情\r'),(545,'古風奇幻','古風\r'),(558,'末世愛情','愛情\r'),(563,'犯罪懸疑','懸疑\r'),(565,'玄幻仙俠','仙俠\r'),(598,'奇幻冒險','冒險\r'),(599,'奇幻校園','校園\r'),(626,'科幻校園','校園\r'),(627,'科幻愛情','愛情\r'),(631,'穿越架空','穿越\r'),(632,'穿越異世界','異世界\r'),(645,'浪漫奇幻','愛情\r'),(646,'浪漫輕喜劇','搞笑\r'),(660,'偽娘攻','BL\r'),(679,'都市療癒','療癒\r'),(682,'都會愛情','愛情\r'),(709,'微靈異奇幻','奇幻\r'),(749,'輕鬆搞笑','搞笑\r'),(785,'懸疑反轉','反轉\r'),(786,'懸疑推理','推理\r'),(798,'戀愛喜劇','搞笑\r'),(802,'驚悚推理','推理\r'),(804,'靈異搞笑','搞笑\r'),(805,'靈異驚悚','驚悚\r');
/*!40000 ALTER TABLE `tag` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-05-08 23:16:22
