CREATE DATABASE  IF NOT EXISTS `mojoin` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `mojoin`;
-- MySQL dump 10.13  Distrib 8.0.41, for Win64 (x86_64)
--
-- Host: localhost    Database: mojoin
-- ------------------------------------------------------
-- Server version	8.0.41

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `author`
--

DROP TABLE IF EXISTS `author`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `author` (
  `aIndex` int unsigned NOT NULL,
  `Name` char(20) DEFAULT NULL,
  PRIMARY KEY (`aIndex`),
  UNIQUE KEY `idAuthor_UNIQUE` (`aIndex`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `author`
--

LOCK TABLES `author` WRITE;
/*!40000 ALTER TABLE `author` DISABLE KEYS */;
INSERT INTO `author` VALUES (1,'_沉默寡言JY'),(2,'1382\r'),(3,'Arzumu\r'),(4,'AstorBT\r'),(5,'Breeze 湯碗貓'),(6,'Caloid Chang'),(7,'Catter\r'),(8,'CC\r'),(9,'DARK櫻薰\r'),(10,'Ditto亦然\r'),(11,'DZ\r'),(12,'ghfjdksl\r'),(13,'K\r'),(14,'killer\r'),(15,'KR\r'),(16,'leviatas\r'),(17,'LKK\r'),(18,'M.貓子、依讀\r'),(19,'Magician\r'),(20,'Mariana_海嘯'),(21,'MisterZoo\r'),(22,'Ms.疏影\r'),(23,'n7\r'),(24,'Ocean\r'),(25,'On\r'),(26,'Rin45\r'),(27,'Setsuna\r'),(28,'TING\r'),(29,'toilet\r'),(30,'TonyTony\r'),(31,'vivi薇安\r'),(32,'yyy\r'),(33,'一代萌神\r'),(34,'一枝寒梅s\r'),(35,'一芳\r'),(36,'一真\r'),(37,'一隻仙子\r'),(38,'一隻莫噠啦\r'),(39,'一朝一暮\r'),(40,'一葉之舟\r'),(41,'七月鼠\r'),(42,'七懶\r'),(43,'九方思想貓\r'),(44,'九命貓\r'),(45,'二兩清歡\r'),(46,'二迴林\r'),(47,'二葉\r'),(48,'八千子\r'),(49,'八月十七\r'),(50,'八爪魚\r'),(51,'十二玉樓\r'),(52,'十二釵\r'),(53,'三棵樹\r'),(54,'上善若水\r'),(55,'上絕\r'),(56,'于紫陽\r'),(57,'子安\r'),(58,'子陽\r'),(59,'小山羊\r'),(60,'小丑魚\r'),(61,'小月彎彎\r'),(62,'小北啊??\r'),(63,'小白菜菜\r'),(64,'小竹燈\r'),(65,'小妖呢喃\r'),(66,'小夜妹子\r'),(67,'小狐狸警官\r'),(68,'小阿祭\r'),(69,'小非\r'),(70,'小甜甜plus\r'),(71,'小蛇hebi\r'),(72,'小魚兒不愛花無缺\r'),(73,'小鹿\r'),(74,'小鹿狂野\r'),(75,'小猴王\r'),(76,'小圓滿\r'),(77,'小貓愛吃糖\r'),(78,'山風旅人\r'),(79,'川菜大王\r'),(80,'巾絲草\r'),(81,'不吃趣多多\r'),(82,'不眠不咻\r'),(83,'不帶劍\r'),(84,'互生眼\r'),(85,'五月八日\r'),(86,'公子漫漫\r'),(87,'公子緋緋\r'),(88,'六月焰\r'),(89,'六花\r'),(90,'化風\r'),(91,'午夜藍\r'),(92,'天下。\r'),(93,'天兵\r'),(94,'孔陽\r'),(95,'尤醬_\r'),(96,'幻華鼠\r'),(97,'文越\r'),(98,'方聽白\r'),(99,'月色靜好\r'),(100,'月初\r'),(101,'月雨海魅\r'),(102,'月亮熊\r'),(103,'月滿棲樓\r'),(104,'月橋禾安\r'),(105,'木子白衣\r'),(106,'木向晚\r'),(107,'木須肉\r'),(108,'水熊\r'),(109,'水龍卷\r'),(110,'火星來的貓\r'),(111,'犬本\r'),(112,'出山\r'),(113,'北府店小二\r'),(114,'卉柯\r'),(115,'半箋淸墨\r'),(116,'卡布D\r'),(117,'可可達鴨\r'),(118,'右璇C\r'),(119,'四月一日的羊\r'),(120,'四隻腳\r'),(121,'巧咪\r'),(122,'巨蠍羊\r'),(123,'本艾\r'),(124,'民小蘇\r'),(125,'永畫\r'),(126,'甘卿玥\r'),(127,'白日幻夢\r'),(128,'白奶包\r'),(129,'白夜\r'),(130,'白砂糖\r'),(131,'白娉羽\r'),(132,'白浪\r'),(133,'白瓷\r'),(134,'白嫵\r'),(135,'禾惠\r'),(136,'亦白\r'),(137,'亦何\r'),(138,'伍六無七\r'),(139,'伍德．瓦懷特\r'),(140,'冰殊靛\r'),(141,'冰雪翎\r'),(142,'吃蘿蔔的蘿蔔。\r'),(143,'吉郁隆程\r'),(144,'名為星賊的草莓蛋糕\r'),(145,'吐維\r'),(146,'地府十三鬼\r'),(147,'多人合集\r'),(148,'妃小絳\r'),(149,'安小米\r'),(150,'安徒離\r'),(151,'安涼\r'),(152,'安普特\r'),(153,'安森希爾\r'),(154,'成王千安\r'),(155,'早藻\r'),(156,'朱夏\r'),(157,'汜羽荃\r'),(158,'百谷蓁蓁\r'),(159,'百里青青\r'),(160,'百沫歌\r'),(161,'竹子空心\r'),(162,'米米爾\r'),(163,'米契\r'),(164,'羽毛冰塊\r'),(165,'羽澤\r'),(166,'自初\r'),(167,'自是年少\r'),(168,'色之羊予沁\r'),(169,'艾艾羅\r'),(170,'艾傑葉林\r'),(171,'艾雅\r'),(172,'西樹泡芙\r'),(173,'佐渡遼歌\r'),(174,'何守琦\r'),(175,'君驍\r'),(176,'妍妍妮子\r'),(177,'妖妖\r'),(178,'妖紅\r'),(179,'妖家四少\r'),(180,'妝瓣兒\r'),(181,'孜然粉哇\r'),(182,'宋玥\r'),(183,'宋桃花\r'),(184,'尾巴Misa\r'),(185,'希澄\r'),(186,'希黎\r'),(187,'忘川公子\r'),(188,'我是阿歡啊\r'),(189,'抒靈\r'),(190,'李子李\r'),(191,'李柏青\r'),(192,'李勤英\r'),(193,'杏花雨瓣兒\r'),(194,'汪界\r'),(195,'沈青荷\r'),(196,'沉魚\r'),(197,'芃凡\r'),(198,'見一抹綠\r'),(199,'言多bi池。\r'),(200,'言湘隱\r'),(201,'豆丁皇后\r'),(202,'走路跌跤\r'),(203,'辛亞\r'),(204,'辰時溪\r'),(205,'阮郎歸\r'),(206,'阮無虞\r'),(207,'亞蘇\r'),(208,'依念\r'),(209,'依澄Q\r'),(210,'依讀\r'),(211,'兔姑姑\r'),(212,'其實一直不懂愛\r'),(213,'初雲\r'),(214,'周小七\r'),(215,'呼嘎HOGA\r'),(216,'夜天\r'),(217,'夜闌無星\r'),(218,'奔跑的小米粒\r'),(219,'姒情\r'),(220,'孟知\r'),(221,'居隱\r'),(222,'披袖\r'),(223,'抹茶熊熊\r'),(224,'拆野拆替\r'),(225,'昇華\r'),(226,'明月昭\r'),(227,'易輕塵\r'),(228,'東之冊\r'),(229,'東邦\r'),(230,'東澤\r'),(231,'東籬黃昏\r'),(232,'松櫝\r'),(233,'枕月\r'),(234,'林北小歐辣\r'),(235,'林洛書\r'),(236,'林暮暮\r'),(237,'林遲染\r'),(238,'欣木\r'),(239,'沫晨優\r'),(240,'牧昭昭\r'),(241,'狐七戒\r'),(242,'狐青夜\r'),(243,'狗妹\r'),(244,'玥主朽紅\r'),(245,'玫瑰\r'),(246,'知玄機\r'),(247,'知岸\r'),(248,'芙蘿\r'),(249,'花末\r'),(250,'花於景\r'),(251,'花陽\r'),(252,'花落瑾殤\r'),(253,'花落餘生\r'),(254,'花鈴\r'),(255,'芸光\r'),(256,'芽豆靈\r'),(257,'長夜\r'),(258,'阿次\r'),(259,'阿悅最帥\r'),(260,'阿素.\r'),(261,'阿曦 A-Xi\r'),(262,'雨沫\r'),(263,'雨墨濂\r'),(264,'青色的文字玩家\r'),(265,'青果果\r'),(266,'青鏡梔子\r'),(267,'青鷹\r'),(268,'南山悠然\r'),(269,'南門椅子\r'),(270,'南翁\r'),(271,'哆魚\r'),(272,'帝華席亞\r'),(273,'彥蕭蕭\r'),(274,'拾七柒\r'),(275,'拾文字戰士\r'),(276,'星小閃\r'),(277,'星野咪魯\r'),(278,'星琛\r'),(279,'星雲\r'),(280,'是阿灼啊\r'),(281,'某宅\r'),(282,'柔兒\r'),(283,'柔親帶笑\r'),(284,'柳十三\r'),(285,'洛千華\r'),(286,'洛夕\r'),(287,'洛華\r'),(288,'流光\r'),(289,'流雲隨風\r'),(290,'流轉\r'),(291,'玲瓏格\r'),(292,'秋雨後的小蘑菇\r'),(293,'紅塵\r'),(294,'美人不美\r'),(295,'胡書\r'),(296,'胡說\r'),(297,'胡蘿蔔大大\r'),(298,'若水亭\r'),(299,'若有魚\r'),(300,'若夏白\r'),(301,'郁芳芳\r'),(302,'陌上無花\r'),(303,'風十柒\r'),(304,'風花雪悅\r'),(305,'風城喵喵\r'),(306,'風順\r'),(307,'風煙一渡\r'),(308,'風煙殘霧\r'),(309,'風落涼\r'),(310,'風輕早\r'),(311,'風韞翔\r'),(312,'倪亞青\r'),(313,'值言\r'),(314,'哩哩呱哩\r'),(315,'唐銀\r'),(316,'夏涼初\r'),(317,'夏翎\r'),(318,'夏顏兮雅\r'),(319,'姬沐\r'),(320,'徐行\r'),(321,'悍兔\r'),(322,'時零\r'),(323,'晉子\r'),(324,'書癮少女「灼鴦」\r'),(325,'桃桃紅柚\r'),(326,'浣曦\r'),(327,'海空\r'),(328,'烏瞳貓\r'),(329,'狸沐柔\r'),(330,'琉璃暖\r'),(331,'真月\r'),(332,'眠卿\r'),(333,'神崎結弦\r'),(334,'笑莫纖然\r'),(335,'粉紅夜/紀帥哥\r'),(336,'草子信\r'),(337,'蚊小七\r'),(338,'衾涼\r'),(339,'高阿諾\r'),(340,'鬼才\r'),(341,'做過頭主義\r'),(342,'啊儀\r'),(343,'執光\r'),(344,'堅強的小榴槤\r'),(345,'帶刺地玫瑰\r'),(346,'常百憶\r'),(347,'康莊\r'),(348,'張氏雅歌\r'),(349,'悠月\r'),(350,'斜月簾櫳\r'),(351,'斬桃\r'),(352,'晨羽\r'),(353,'望宸\r'),(354,'梧玖\r'),(355,'梨花微雕\r'),(356,'淩美\r'),(357,'淺夕顏\r'),(358,'淺暖星一\r'),(359,'清粥醬菜\r'),(360,'珺婷\r'),(361,'甜茶茶\r'),(362,'盛秋\r'),(363,'竟然\r'),(364,'符晴\r'),(365,'紬實\r'),(366,'莓果醬\r'),(367,'蛋目卡凡\r'),(368,'袍今\r'),(369,'覓福\r'),(370,'許花錢\r'),(371,'逢時\r'),(372,'雪珊瑚\r'),(373,'雪翼\r'),(374,'魚本鹹\r'),(375,'鹿何往\r'),(376,'鹿溫久\r'),(377,'喵喵cat\r'),(378,'喵醬子（蠢貓）\r'),(379,'壹那由他\r'),(380,'寒山寺\r'),(381,'寒錦\r'),(382,'尋花\r'),(383,'散狐\r'),(384,'斯恩\r'),(385,'景井\r'),(386,'景慕輕塵\r'),(387,'晴空希望\r'),(388,'棠巢栗子\r'),(389,'森林野生小石榴子\r'),(390,'湯元元\r'),(391,'無胥\r'),(392,'無聊種子\r'),(393,'無晴\r'),(394,'琳聽\r'),(395,'琴倚墨\r'),(396,'發散黃色\r'),(397,'程小樹\r'),(398,'程雪森\r'),(399,'筆尖的軌跡\r'),(400,'紫果瓊漿\r'),(401,'紫電昭陽\r'),(402,'紫曜日\r'),(403,'結寶\r'),(404,'翔君\r'),(405,'菊花清茶\r'),(406,'華樂清雅\r'),(407,'萌寶寶\r'),(408,'詠名\r'),(409,'逸清\r'),(410,'閒魚乾\r'),(411,'雲上錦書\r'),(412,'雲夕雅兮\r'),(413,'雲水靜\r'),(414,'雲染\r'),(415,'雲說\r'),(416,'飲月\r'),(417,'馮子緣\r'),(418,'黑米BR\r'),(419,'黑色油漆\r'),(420,'黑糖君\r'),(421,'黑霧\r'),(422,'塗頂\r'),(423,'微混吃等死\r'),(424,'微靈\r'),(425,'意外\r'),(426,'愛不說\r'),(427,'愛抹茶的琴姐\r'),(428,'楊寒\r'),(429,'楚慕風\r'),(430,'睦方\r'),(431,'筱筱\r'),(432,'聖\r'),(433,'落花灼\r'),(434,'葉兒綠\r'),(435,'葉怪怪\r'),(436,'路星\r'),(437,'路圓圓\r'),(438,'路邊攤\r'),(439,'遁逃的魚\r'),(440,'違天\r'),(441,'釉子酒\r'),(442,'隔壁張大媽\r'),(443,'雷明\r'),(444,'雷迪\r'),(445,'嘎吱兒\r'),(446,'團子喵\r'),(447,'寧鳶\r'),(448,'慣看春秋\r'),(449,'澈漓\r'),(450,'熊雯雯\r'),(451,'熒夜\r'),(452,'瑪琪朵\r'),(453,'瘋狂的蘋果\r'),(454,'盡歡\r'),(455,'綠籬晚晚\r'),(456,'綰公子\r'),(457,'綸生\r'),(458,'緋瑟兒\r'),(459,'臧語瞳\r'),(460,'舞落葉\r'),(461,'蒔九\r'),(462,'蒼山月\r'),(463,'蒼燁\r'),(464,'輕陌\r'),(465,'辣筆小新\r'),(466,'銀簽\r'),(467,'鳳梨蛋炒飯\r'),(468,'劉淡淡。\r'),(469,'墨九爺\r'),(470,'墨十二\r'),(471,'墨小言\r'),(472,'墨妲妲\r'),(473,'墨玲瓏\r'),(474,'慕容小杰\r'),(475,'暮辰\r'),(476,'樰落\r'),(477,'歐果\r'),(478,'歐畢零三\r'),(479,'潘柏霖\r'),(480,'熟魚片\r'),(481,'緬因吉\r'),(482,'蓬暗\r'),(483,'蔚海\r'),(484,'蝸牛夢夢\r'),(485,'諸戈\r'),(486,'鄭十七\r'),(487,'醉蝠\r'),(488,'醉櫻落\r'),(489,'鴉青染\r'),(490,'橘子可妃\r'),(491,'橙瓜攸攸\r'),(492,'燈下細雨\r'),(493,'燕南飛\r'),(494,'燕思\r'),(495,'獨白的小瑪麗\r'),(496,'禦七君\r'),(497,'糖小卡\r'),(498,'蕭瑟\r'),(499,'貓十七\r'),(500,'貓小北\r'),(501,'貓梓\r'),(502,'貓邏\r'),(503,'錦七七\r'),(504,'優析\r'),(505,'應該\r'),(506,'檀檀欒\r'),(507,'繁星落\r'),(508,'翼翎\r'),(509,'聲聲慢－\r'),(510,'薇薇公主病\r'),(511,'薛西斯\r'),(512,'霜楓\r'),(513,'黛夢\r'),(514,'點絳唇\r'),(515,'薩佐\r'),(516,'藍衣初雲\r'),(517,'藍星諾\r'),(518,'蟬鳴半夏\r'),(519,'雞肉捲捲捲\r'),(520,'馥閒庭\r'),(521,'廬陵筆邪\r'),(522,'瀟冉\r'),(523,'瀨葉\r'),(524,'藤\r'),(525,'贈你明珠\r'),(526,'鏟屎公\r'),(527,'鏡無影\r'),(528,'鏡道記\r'),(529,'韻白\r'),(530,'鯨頭鸛先生\r'),(531,'懸玲不語\r'),(532,'曦昔\r'),(533,'瀰霜\r'),(534,'蘇杧\r'),(535,'蘇晴川\r'),(536,'蘇裳\r'),(537,'蘇銳\r'),(538,'蘇聽雨\r'),(539,'麵團包銀圓\r'),(540,'顧小染\r'),(541,'鶯時醉\r'),(542,'聽說南方\r'),(543,'戀月兒\r'),(544,'艷少\r'),(545,'靈魂錯亂\r'),(546,'蠻不講理\r'),(547,'鑽石心\r'),(548,'鬱兔\r');
/*!40000 ALTER TABLE `author` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-05-05  1:58:39
